---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisZone
source: html/80b6c221-ead6-0543-7aac-713d7ccab53d.htm
---
# EnergyAnalysisZone Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.